<template>
  <div class="app-container">
    <el-card class="card" header="平台简介">
      <div class="word">
        <div>
          描述：针对新型冠状病毒出现的在人际之间的高传染性，我们设计了一个针对人际传播的回溯监控预测大数据工具类框架，可以有效的还原确诊患者、疑似患者、可能的接触人群在潜伏期内的活动轨迹，并以直观的方式进行展现。提供给政府、相关卫生防疫部门进行决策支撑。
        </div>
        <div>
          因为我们设计的是开源框架，且团队自身能力有限，因此框架中预留了运营商数据模块、疫情模型预测模块、信息发布模块（互联网平台对接），我们期望可以发挥集体的力量完善平台功能，使得这个框架可以成为今后所有传染类疫情的大数据决策支撑平台。
        </div>
        <div>
          我们高度重视机构与患者的数据隐私保护，因此该平台的使用不会进行任何数据传输与共享，任何机构都可以直接下载并私有化部署，并在导入自有数据后进行使用。后续我们会在平台框架中加入较多的数据隐私保护技术，实现对使用平台者数据的高安全保护。
        </div>
        <div>
          该平台使用为公益性质，全部免费，同时同态应急团队人员会提供7*24小时的远程技术支持，帮助有需求的机构进行平台部署与使用，我们期待可以早日控制住疫情发展，早日让大家恢复正常的生活。
        </div>
        <div>
          武汉加油！中国加油！
        </div>
        <div>
          （联系我们：李工（协调）：15001925153，朱工（远程支持）：15001950162，盛工（远程支持）:17521024457）
        </div>
      </div>
    </el-card>
  </div>
</template>

<script>

export default {
  name: 'Dashboard',
  data() {
    return {}
  },
  computed: {},
  watch: {},
  mounted() {
  }
}
</script>

<style lang="scss" type="text/scss" scoped>
  .card {
    width: 500px;
    margin: 0 auto;
    .word {
      text-indent: 2em
    }
  }
</style>
